# GetWSCellsImgDPIRes

## Description
Gets the DPI resolution for images in the specified worksheet.

```pascal
PROCEDURE GetWSCellsImgDPIRes(
				worksheet         : HANDLE;
				VAR dpiResolution : INTEGER);
```

```python

def vs.GetWSCellsImgDPIRes(worksheet):
    return dpiResolution
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|The worksheet handle.|
|dpiResolution|INTEGER|The images' DPI resolution|

## Version
Availability: from Vectorworks 2017
## Category
* Worksheets